app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["updated_at", "2020-02-29 05:42:52.402799"], ["id", 1]]
---
  def update

    @article=Article.find(params[:id])
    @article.update(title: params[:article][:title]) if !params[:article][:title].empty?